# Количество слов
# Дана строка, состоящая из слов, разделенных пробелами. 
# Напишите программу, которая подсчитывает количество слов 
# в этой строке.

# Формат входных данных
# На вход программе подается строка.

# Формат выходных данных
# Программа должна вывести количество слов в строке.

# Примечание 1. Кроме слов в тексте могут присутствовать 
# только пробелы (один или несколько).
# Примечание 2. Решите задачу в одну строчку кода.

# Тестовые данные
# Sample Input 1:
# Hello world
# Sample Output 1:
# 2
# Sample Input 2:
# Timur forever young
# Sample Output 2:
# 3

# a="Timur     forever young"
# print(a.split())
# print(len(a.split()))




# С клавиатуры вводятся две буквы (в одну строку через пробел)
# вывести след.строку: "Коды: буква1=код буквы1, буква2=код буквы2"

# a,b=input().split()
# print("Коды: "+a+" = "+str(ord(a))+", "+b+" = "+str(ord(b)))






